Revit 2024 API
Element.ChangeTypeId Method
Overload List
Name | Description
ChangeTypeId(ElementId)
 Changes the type of the element.
ChangeTypeId(Document, ICollection<ElementId>, ElementId)
 Changes the type of all elements in the given set.
See Also
Element Class
Element Members
Autodesk.Revit.DB Namespace